client/results/rq2/h1/stresstest/client_32/summary.txt
starting benchmark...
spawning thread #0: 16 total client(s). 25000 total requests
spawning thread #1: 16 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 10.13s, 4935.01 req/s, 21.64MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      462us     31.82ms      6.42ms      3.20ms    72.79%
time for connect:     9.52ms     37.10ms     20.46ms      6.94ms    68.75%
time to 1st byte:    21.07ms     55.93ms     31.39ms      7.78ms    71.88%
req/s           :     154.19      158.51      155.29        0.95    81.25%